# 殷志忠老師(TeacherYin.com)

def 輸入產品():
    # 函數裡面的變數，區域變數(不共享)，只能在函數內部使用，其他程式無法使用
    數量 = int(input('請輸入數量:'))
    編號 = input('請輸入編號:')
    價格 = float(input('請輸入價格:'))
    return 數量,編號,價格  # 結束函數 有返回值

def 顯示產品():
    # f字串
    s = f"訂購了 產品編號 {編號} 價格 {價格:.2f} 數量 {數量}  總金額 {總金額:,.2f} "
    print(s)
    return  # 結束函數 沒有返回值 (可省略不寫)

def 計算總金額():
    總金額 = 數量 * 價格
    return 總金額  # 結束函數 有返回值


# 主程式 全域變數(共享)
數量,編號,價格 = 輸入產品()
總金額 = 計算總金額()
顯示產品()

#
# def 輸入產品():
#     # 函數裡面的變數，區域變數(不共享)，只能在函數內部使用，其他程式無法使用
#     數量 = int(input('請輸入數量:'))
#     編號 = input('請輸入編號:')
#     價格 = float(input('請輸入價格:'))
#     return 數量,編號,價格  # 結束函數 有返回值
#
# def 顯示產品():
#     # f字串
#     s = f"訂購了 產品編號 {編號} 價格 {價格:.2f} 數量 {數量}  總金額 {總金額:,.2f} "
#     print(s)
#     return  # 結束函數 沒有返回值 (可省略不寫)
#
# def 計算總金額():
#     總金額 = 數量 * 價格
#     return 總金額  # 結束函數 有返回值
#
#
# # 主程式 全域變數(共享)
# 數量,編號,價格 = 輸入產品()
# 總金額 = 計算總金額()
# 顯示產品()
