# 殷志忠老師(TeacherYin.com)

# 子程式 只是定義程式(小弟)
def 輸入產品():
    # 函數裡面的變數，區域變數(不共享)，只能在函數內部使用，其他程式無法使用
    數量 = int(input('請輸入數量:'))
    編號 = input('請輸入編號:')
    價格 = float(input('請輸入價格:'))
    return 數量, 編號, 價格  # 結束函數 有返回值

def 顯示產品():
    # f字串
    s = f"訂購了 產品編號 {編號} 價格 {價格:.2f} 數量 {數量}  總金額 {總金額:,.2f} "
    print(s)
    return  # 結束函數 沒有返回值 (return 可省略不寫)

def 計算總金額(): # 定義 function 只能等待被呼叫 所以定義的順序不影響執行
    總金額 = 數量 * 價格
    return 總金額  # 結束函數 有返回值


# 主程式 呼叫子程式執行(老大)
# 全域變數 放在 function 的定義區塊之外(共享)
# 主程式 在全域賦值 變數
數量,編號,價格 = 輸入產品() # 將輸入產品()的 return 值 賦值給全域變數 數量 編號 價格 (與 function 內定義的區域變數 數量 編號 價格 無關)
總金額 = 計算總金額() # 將計算總金額()的 return 值 賦值給全域變數 總金額 (與 function 內定義的區域變數 總金額 無關)
# 主程式 呼叫顯示產品來執行
顯示產品()