def 輸入產品(): # 等待呼叫 不必接住外來參數 自行輸入參數
    # 函數裡面的變數，區域變數(不共享)，只能在函數內部使用，其他程式無法使用
    數量 = int(input('請輸入數量:'))
    編號 = input('請輸入編號:')
    價格 = float(input('請輸入價格:'))
    return 數量,編號,價格  # 結束函數 有返回值

def 顯示產品(數量, 編號, 價格, 總金額):  # 等待呼叫 預備接住外面傳來的參數 數量, 編號, 價格, 總金額
    # f字串
    s = f"訂購了 產品編號 {編號} 價格 {價格:.2f} 數量 {數量}  總金額 {總金額:,.2f} "
    print(s)
    # return  # 結束函數 沒有返回值 (可省略不寫)

def 計算總金額(數量, 價格):  # 等待呼叫 預備接住外面傳來的參數 數量, 價格
    總金額 = 數量 * 價格
    return 總金額  # 結束函數 有返回值

def 執行():   # 主程式執行 預備依照設計 呼叫 所有用到的 子程式
    數量, 編號, 價格 = 輸入產品()  # 執行輸入產品() 將 return 值 賦值 給變數 數量 編號 價格
    總金額 = 計算總金額(數量, 價格) # 呼叫 計算總金額() 取用 剛賦值的變數 數量 價格, 將執行結果 return 值 賦值給變數 總金額
    顯示產品(數量, 編號, 價格, 總金額) # 呼叫 顯示產品() 取用 剛賦值的所有變數 數量 編號 價格 總金額
    return 總金額

# 主程式 全域變數(共享)
執行()

# 全域 區域 是相對的
# 在 程式內呼叫 子程式 此時 子程式內變數 為區域 主程式內變數為全域